---
kind: property
id: P:Autodesk.Revit.DB.IFC.ExporterIFC.FileName
source: html/9b84d587-4fb1-5fdc-3f8a-c169081c99f5.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.FileName Property

The name of the IFC file being exported.

## Syntax (C#)
```csharp
public string FileName { get; }
```